============================================
Abort
============================================
abort
abort "message"
abort abort
abort abort "message"
abort {1; "msg"}

abort
"msg" # this is NOT part of the abort expression
---

(program
  (exprs
    (expr (abort))
    (expr (abort (expr (literal (string)))))
    (expr (abort (expr (abort))))
    (expr (abort (expr (abort (expr (literal (string)))))))
    (expr (abort (expr (container (block (exprs (expr (literal (integer))) (expr (literal (string)))))))))

    (expr (abort))
    (expr (literal (string)))
  )
)


============================================
If Statement
============================================
if true { false }
if true { false } else { true }
if true { false } else if false { true } else { false }
if (true; false) { true }
---

(program
  (exprs
    (expr (if_statement
      (predicate (expr (literal (boolean))))
      (block (exprs (expr (literal (boolean)))))
    ))
    (expr (if_statement
      (predicate (expr (literal (boolean))))
      (block (exprs (expr (literal (boolean)))))
      (block (exprs (expr (literal (boolean)))))
    ))
    (expr (if_statement
      (predicate (expr (literal (boolean))))
      (block (exprs (expr (literal (boolean)))))
      (predicate (expr (literal (boolean))))
      (block (exprs (expr (literal (boolean)))))
      (block (exprs (expr (literal (boolean)))))
    ))
    (expr (if_statement
      (predicate (exprs (expr (literal (boolean))) (expr (literal (boolean)))))
      (block (exprs (expr (literal (boolean)))))
    ))
  )
)

============================================
Assignment
============================================
_ = 5
.x = 5
{}.x = 5
.ok , .err = 5
ok, err = 5
---

(program
  (exprs
    (expr (assignment_expr (assignment_target (assignment_target_noop)) (assignment_op) (expr (literal (integer)))))
    (expr (assignment_expr (assignment_target (query (target_query (target_query_prefix) (query_segments (query_field))))) (assignment_op) (expr (literal (integer)))))
    (expr (assignment_expr (assignment_target (query (container_query (container (object)) (query_segments (query_field))))) (assignment_op) (expr (literal (integer)))))
    (expr (assignment_expr
      (assignment_target (query (target_query (target_query_prefix) (query_segments (query_field)))))
      (assignment_target (query (target_query (target_query_prefix) (query_segments (query_field)))))
      (assignment_op) (expr (literal (integer)))))
    (expr (assignment_expr
      (assignment_target (query (local_query (local_variable))))
      (assignment_target (query (local_query (local_variable))))
      (assignment_op) (expr (literal (integer)))))
  )
)

============================================
Error Coalesce
============================================
x ?? true
---

(program
  (exprs
    (expr (error_coalesce_expr
      (expr (query (local_query (local_variable))))
      (expr (literal (boolean)))
    ))
  )
)

